DataProcessors/CRM_ФормаСпискаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>CRM_ФормаСпискаКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтрагентВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентВидОтношений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимоотношений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/CRM_ФормаСпискаКонтрагентов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокКонтрагентовПриАктивизацииСтроки(Элемент)

	КонтрагентВидКонтрагента = ?(Элемент.ТекущиеДанные = Неопределено, ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ПустаяСсылка"), Элемент.ТекущиеДанные.Контрагент.ВидКонтрагента);
	КонтрагентНаименование = ?(Элемент.ТекущиеДанные = Неопределено, "", Элемент.ТекущиеДанные.Контрагент.Наименование);
	КонтрагентОсновнойБанковскийСчет = ?(Элемент.ТекущиеДанные = Неопределено, ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка"), Элемент.ТекущиеДанные.Контрагент.ОсновнойБанковскийСчет);
	КонтрагентВидВзаимоотношений = ?(Элемент.ТекущиеДанные = Неопределено, ПредопределенноеЗначение("Справочник.ВидыВзаимоотношений.ПустаяСсылка"), Элемент.ТекущиеДанные.Контрагент.ВидОтношений);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("Наименование", "%");
	СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("ПредставлениеКИ", "%");
	СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("ОтборПоКИ", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискФиоПриИзменении(Элемент)
	
	//СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("Наименование", "%" + ИтоговаяСтрока + ?(ИтоговаяСтрока = "", "%", ""));
	СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("Наименование", "%"+СокрЛП(ПоискФио)+"%");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные.Тип = "Контрагент" Тогда
		Элемент.ТекущиеДанные.Контрагент.ПолучитьФорму().Открыть();
	ИначеЕсли Элемент.ТекущиеДанные.Тип = "Потенциальный" Тогда
		Форма = ПолучитьФорму("ОбщаяФорма.CRM_ФормаКарточкиКлиента");
		Форма.Клиент = Элемент.ТекущиеДанные.Контрагент;
		Форма.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискТелефонПриИзменении(Элемент)
	
	ИзменитьТекстНаСервере();
	
	//СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("ОтборПоКИ", ЗначениеЗаполнено(ПоискТелефон));
	Если ЗначениеЗаполнено(ПоискТелефон) Тогда
		СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("ПредставлениеКИ", "%"+СокрЛП(ПоискТелефон)+"%");
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьТекстНаСервере()
	
	Если ЗначениеЗаполнено(ПоискТелефон) Тогда
		СписокКонтрагентов.ТекстЗапроса = 
			"ВЫБРАТЬ
			|	КонтактнаяИнформация.Объект КАК Контрагент,
			|	КонтактнаяИнформация.Объект.ВидКонтрагента КАК ВидКонтрагента,
			|	КонтактнаяИнформация.Объект.ВидОтношений КАК ВидОтношений,
			|	КонтактнаяИнформация.Объект.Автор КАК Автор,
			|   ВЫБОР
			|      КОГДА КонтактнаяИнформация.Объект Ссылка Справочник.Контрагенты Тогда
			|			""Контрагент""
			|	   ИНАЧЕ
			|			""Потенциальный""
			|	КОНЕЦ КАК Тип,
			|	КонтактнаяИнформация.Объект.Пол КАК Пол,
			|	КонтактнаяИнформация.Представление КАК ПредставлениеКИ
            |
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
			|	И КонтактнаяИнформация.Представление ПОДОБНО &ПредставлениеКИ
			|	И (КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты ИЛИ КонтактнаяИнформация.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты)
			|	И КонтактнаяИнформация.Объект.Наименование ПОДОБНО &Наименование";
	Иначе СписокКонтрагентов.ТекстЗапроса = 
			//"ВЫБРАТЬ
			//|	КонтрагентыСКИ.Контрагент,
			//|	КонтрагентыСКИ.Тип,
			//|	КонтрагентыСКИ.ВидОтношений,
			//|	КонтрагентыСКИ.ВидКонтрагента,
			//|	КонтрагентыСКИ.Пол,
			//|	КонтрагентыСКИ.Автор,
			//|	КонтрагентыСКИ.ПредставлениеКИ
			//|ИЗ
			//|	(ВЫБРАТЬ
			"ВЫБРАТЬ
			|		Контрагенты.Контрагент КАК Контрагент,
			|		Контрагенты.Тип КАК Тип,
			|		Контрагенты.ВидОтношений КАК ВидОтношений,
			|		Контрагенты.ВидКонтрагента КАК ВидКонтрагента,
			|		Контрагенты.Пол КАК Пол,
			|		Контрагенты.Автор КАК Автор,
			|		ВЫБОР
			|			КОГДА КонтактнаяИнформация.Представление ЕСТЬ NULL 
			|				ТОГДА """"
			|			ИНАЧЕ КонтактнаяИнформация.Представление
			|		КОНЕЦ КАК ПредставлениеКИ
			|	ИЗ
			|		(ВЫБРАТЬ
			|			CRM_ПотенциальныеКонтрагенты.Ссылка КАК Контрагент,
			|			""Потенциальный"" КАК Тип,
			|			CRM_ПотенциальныеКонтрагенты.ВидОтношений КАК ВидОтношений,
			|			CRM_ПотенциальныеКонтрагенты.ВидКонтрагента КАК ВидКонтрагента,
			|			CRM_ПотенциальныеКонтрагенты.Пол КАК Пол,
			|			CRM_ПотенциальныеКонтрагенты.Автор КАК Автор
			|		ИЗ
			|			Справочник.CRM_ПотенциальныеКонтрагенты КАК CRM_ПотенциальныеКонтрагенты
			|		ГДЕ
			|			CRM_ПотенциальныеКонтрагенты.Наименование ПОДОБНО &Наименование
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			Контрагенты.Ссылка,
			|			""Контрагент"",
			|			Контрагенты.ВидОтношений,
			|			Контрагенты.ВидКонтрагента,
			|			Контрагенты.Пол,
			|			Контрагенты.Автор
			|		ИЗ
			|			Справочник.Контрагенты КАК Контрагенты
			|		ГДЕ
			|			Контрагенты.Наименование ПОДОБНО &Наименование) КАК Контрагенты
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|	ПО Контрагенты.Контрагент = КонтактнаяИнформация.Объект
			|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
			
	КонецЕсли;
	
КонецПроцедуры
